IDEA Connection Link
ConnectionLink.RunHiddenAnalysis Method
 Returns string which represents xml with results of the connection CBFEM design
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public void RunHiddenAnalysis(
	Stream iomStream,
	Stream resultsStream,
	Stream existingConProjStream,
	Stream requiredTemplateStream,
	Stream importSettingsStream,
	bool closeInputStreams
)
Public Sub RunHiddenAnalysis (
	iomStream As Stream,
	resultsStream As Stream,
	existingConProjStream As Stream,
	requiredTemplateStream As Stream,
	importSettingsStream As Stream,
	closeInputStreams As Boolean
)
public:
void RunHiddenAnalysis(
	Stream^ iomStream,
	Stream^ resultsStream,
	Stream^ existingConProjStream,
	Stream^ requiredTemplateStream,
	Stream^ importSettingsStream,
	bool closeInputStreams
)
Parameters
iomStream
Type: System.IO.Stream
The input stream which includes IdeaOpenModel (in xml format)
resultsStream
Type: System.IO.Stream
The input stream which includes OpenModelResult (in xml format)
existingConProjStream
Type: System.IO.Stream
The input stream which includes Idea Connection project (binary data)
requiredTemplateStream
Type: System.IO.Stream
The input stream which includes Idea Connection remplate (CONTEMP file)
importSettingsStream
Type: System.IO.Stream
Connection import settings
closeInputStreams
Type: System.Boolean
If true all input streams are closed after reading data
Return Value
Type:
Xml string or null
See Also
Reference
ConnectionLink Class
IdeaRS.ConnectionLink Namespace